Revit 2024 API
FamilyManager.AddParameter Method (String, ForgeTypeId, Category, Boolean)
Add a new family type parameter to control the type of a nested family within another family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyParameter AddParameter(
	string parameterName,
	ForgeTypeId groupTypeId,
	Category familyCategory,
	bool isInstance
)
Visual Basic
Public Function AddParameter ( _
	parameterName As String, _
	groupTypeId As ForgeTypeId, _
	familyCategory As Category, _
	isInstance As Boolean _
) As FamilyParameter
Visual C++
public:
FamilyParameter^ AddParameter(
	String^ parameterName,
	ForgeTypeId^ groupTypeId,
	Category^ familyCategory,
	bool isInstance
)
Parameters
parameterName
Type: System.String
The name of the new family parameter.
groupTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
The identifier of the group to which the family parameter belongs.
familyCategory
Type: Autodesk.Revit.DB.Category
The category to which the new family parameter binds.
isInstance
Type: System.Boolean
Indicates if the new family parameter is instance or type.
Return Value
If creation was successful the new parameter is returned, otherwise an exception with failure information will be thrown.
Remarks
This method can work even without any family type, but it cannot be assigned the value via FamilyManager.Set methods when there is no current type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-"parameterName"-is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input argument-"parameterName"-is already in use, or the input parameter group cannot be assigned to the new parameter, or the input argument-"familyCategory"-is illegal to bind with parameter.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the required family of familyCategory is not existing in current document, , or when the creation failed. Or trying to add an instance parameter of image type.
See Also
FamilyManager Class
AddParameter Overload
Autodesk.Revit.DB Namespace